In [1]:
import pandas as pd
import numpy as np

# Sample DataFrame
data = {
    'ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', np.nan, 'Eve', 'Frank', 'Grace', 'Hannah', 'Ian'],
    'Age': [25, np.nan, 30, 22, 28, np.nan, 24, 29, 31, 27],
    'Salary': [50000, 60000, np.nan, 45000, 52000, 62000, 48000, np.nan, 70000, 75000],
    'Department': ['HR', 'Finance', 'IT', 'HR', 'Finance', np.nan, 'IT', 'HR', 'Finance', 'IT'],
    'Join_Date': ['2022-01-10', '2021-07-15', '2020-06-20', '2019-09-25', '2021-11-30', '2020-05-19', np.nan, '2018-12-22', '2017-10-10', '2016-08-15']
}

df = pd.DataFrame(data)
df['Join_Date'] = pd.to_datetime(df['Join_Date'])  # Convert Join_Date to datetime
df

    ID     Name   Age   Salary Department  Join_Date
0  101    Alice  25.0  50000.0         HR 2022-01-10
1  102      Bob   NaN  60000.0    Finance 2021-07-15
2  103  Charlie  30.0      NaN         IT 2020-06-20
3  104    David  22.0  45000.0         HR 2019-09-25
4  105      NaN  28.0  52000.0    Finance 2021-11-30
5  106      Eve   NaN  62000.0        NaN 2020-05-19
6  107    Frank  24.0  48000.0         IT        NaT
7  108    Grace  29.0      NaN         HR 2018-12-22
8  109   Hannah  31.0  70000.0    Finance 2017-10-10
9  110      Ian  27.0  75000.0         IT 2016-08-15

1. Find the total number of missing values in each column.

2. Fill missing values in the "Age" column with the median age.

3. Replace missing values in the "Salary" column with the average salary.

4. Drop all rows where "Name" is missing.

5. Fill missing values in the "Department" column with the most frequent department.

6. Remove rows where more than 2 values are missing.

7. Filter out employees whose salary is greater than 60,000.

8. Select only employees from the "IT" department.

9. Filter out employees younger than 25 years.

10. Get details of employees who joined before 2020.

11. Find employees who belong to either the "HR" or "Finance" department.

12. Retrieve employees whose age is between 25 and 30.

13. Sort the DataFrame by "Salary" in descending order.

14. Sort the DataFrame first by "Department" (A-Z) and then by "Salary" (High to Low).

15. Rearrange the DataFrame based on "Join_Date" (oldest employees first).

16. Identify if there are any duplicate rows in the DataFrame.

17. Drop duplicate rows based on "Department", keeping only the first occurrence.

18. Drop duplicate rows based on "Salary", keeping the last occurrence.

19. Add a new column "Experience", calculated as the difference between the current year (2024) and the Join_Date.

20. Create a new column "High Salary" by using lambda where employees earning more than 60,000 are labeled "Yes", otherwise "No".

In [20]:
import pandas as pd
from datetime import datetime, timedelta

# Sample DataFrame
data = {
    'Employee_ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Joining_Date': ['2020-06-15', '2019-08-20', '2021-11-05', '2018-03-12', '2022-01-10'],
    'Monthly_Salary': [50000, 60000, 45000, 70000, 55000]
}

df = pd.DataFrame(data)
df['Joining_Date'] = pd.to_datetime(df['Joining_Date'])

# Today's date
today = datetime.now()

# Calculate last working date
df['Last_Working_Date'] = today + timedelta(days=30)

# Calculate total salary earned
df['Total_Salary_Earned'] = ((today - df['Joining_Date']).dt.days / 30) * df['Monthly_Salary']

df

,Employee_ID,Name,Joining_Date,Monthly_Salary,Last_Working_Date,Total_Salary_Earned
0,101,Alice,2020-06-15,50000,2025-03-29 00:40:42.049355,2.863333e+06
1,102,Bob,2019-08-20,60000,2025-03-29 00:40:42.049355,4.036000e+06
2,103,Charlie,2021-11-05,45000,2025-03-29 00:40:42.049355,1.815000e+06
3,104,David,2018-03-12,70000,2025-03-29 00:40:42.049355,5.936000e+06
4,105,Emma,2022-01-10,55000,2025-03-29 00:40:42.049355,2.097333e+06

In [18]:
x=(today-df['Joining_Date'])
x

0   1718 days 00:23:13.144619
1   2018 days 00:23:13.144619
2   1210 days 00:23:13.144619
3   2544 days 00:23:13.144619
4   1144 days 00:23:13.144619
Name: Joining_Date, dtype: timedelta64[ns]

In [19]:
x=today
x

datetime.datetime(2025, 2, 27, 0, 23, 13, 144619)

In [29]:
import pandas as pd
import numpy as np

# Sample DataFrame
data = {
    'Employee_ID': [101, 102, 103, 104, 105, 106],
    'Name': ['Alice', 'Bob', 'Charlie', np.nan, 'Emma', np.nan],
    'Age': [25.0, np.nan, 30.0, 28.0, np.nan, np.nan],
    'Department': ['HR', 'IT', np.nan, 'Finance', np.nan, np.nan],
    'Salary': [50000.0, 60000.0, 45000.0, np.nan, 55000.0, np.nan],
    'Joining_Date': ['2020-06-15', '2019-08-20', '2021-11-05', '2018-03-12', np.nan, np.nan]
}

df = pd.DataFrame(data)
print(df)

# Remove rows with more than 3 missing values
df_cleaned = df.dropna(thresh=3)

df_cleaned

   Employee_ID     Name   Age Department   Salary Joining_Date
0          101    Alice  25.0         HR  50000.0   2020-06-15
1          102      Bob   NaN         IT  60000.0   2019-08-20
2          103  Charlie  30.0        NaN  45000.0   2021-11-05
3          104      NaN  28.0    Finance      NaN   2018-03-12
4          105     Emma   NaN        NaN  55000.0          NaN
5          106      NaN   NaN        NaN      NaN          NaN

   Employee_ID     Name   Age Department   Salary Joining_Date
0          101    Alice  25.0         HR  50000.0   2020-06-15
1          102      Bob   NaN         IT  60000.0   2019-08-20
2          103  Charlie  30.0        NaN  45000.0   2021-11-05
3          104      NaN  28.0    Finance      NaN   2018-03-12
4          105     Emma   NaN        NaN  55000.0          NaN